In [1]:
from sqlalchemy import *
from sqlalchemy import Table, Column, Integer, String, MetaData, text
from sqlalchemy.sql import select

In [2]:
uri = 'postgresql+psycopg2://postgres:postgres@host.docker.internal:5432/postgres'
engine = create_engine(uri, echo=False)
connection = engine.connect() # connect to the database
print(engine)

Engine(postgresql+psycopg2://postgres:***@host.docker.internal:5432/postgres)

In [3]:
# Returns a list of all table names available in the database
ls = engine.table_names()
print(ls)

[]

In [4]:
# Object Relational Mapper
metadata = MetaData(connection)
print(metadata)

MetaData(bind=<sqlalchemy.engine.base.Connection object at 0x000002860990BF40>)

In [5]:
# Creating Table
users = Table(
   'users', metadata, 
   Column('user_id', Integer, primary_key = True), 
   Column('name', String), 
   Column('lastname', String),
)

users.create()

In [6]:
# Executing Expression
insert = users.insert()
insert.execute(name = 'Ravi', lastname = 'Kapoor')

In [7]:
insert.execute({'name':'Rajiv', 'lastname' : 'Khanna'},
   {'name':'Komal','lastname' : 'Bhandari'},
   {'name':'Abdul','lastname' : 'Sattar'},
   {'name':'Priya','lastname' : 'Rajhans'})

In [8]:
# This allows us to create transaction commands
trans = connection.begin()
connection.execute("INSERT INTO users (name) VALUES ('Alex')")
trans.commit()

In [9]:
# Selecting Row
result = connection.execute("SELECT VERSION()")
print(result.fetchone())

('PostgreSQL 13.2 (Debian 13.2-1.pgdg100+1) on x86_64-pc-linux-gnu, compiled by gcc (Debian 8.3.0-6) 8.3.0, 64-bit',)

In [10]:
# Selecting Rows
sel = users.select()
exe = sel.execute()

row = exe.fetchone()
print(row)

result = exe.fetchall()
for row in result:
    print(row)

(1, 'Ravi', 'Kapoor')
(2, 'Rajiv', 'Khanna')
(3, 'Komal', 'Bhandari')
(4, 'Abdul', 'Sattar')
(5, 'Priya', 'Rajhans')
(6, 'Alex', None)

In [11]:
sel = users.select()
result = connection.execute(sel)

for row in result:
    print(row)

(1, 'Ravi', 'Kapoor')
(2, 'Rajiv', 'Khanna')
(3, 'Komal', 'Bhandari')
(4, 'Abdul', 'Sattar')
(5, 'Priya', 'Rajhans')
(6, 'Alex', None)

In [12]:
sql = text("SELECT * FROM users ORDER BY lastname")
result = connection.execute(sql)

for row in result:
    print (row)

(3, 'Komal', 'Bhandari')
(1, 'Ravi', 'Kapoor')
(2, 'Rajiv', 'Khanna')
(5, 'Priya', 'Rajhans')
(4, 'Abdul', 'Sattar')
(6, 'Alex', None)

In [13]:
# The "users" table exists, we load it from the database using "autoload"
users = Table('users', metadata, autoload=True)

def run(stmt):
    rs = stmt.execute()
    for row in rs:
        print(row)
        
query = users.select(users.c.name == 'Alex')
run(query)

q = users.select(users.c.user_id > 1 )
run(q)

(6, 'Alex', None)
(2, 'Rajiv', 'Khanna')
(3, 'Komal', 'Bhandari')
(4, 'Abdul', 'Sattar')
(5, 'Priya', 'Rajhans')
(6, 'Alex', None)

In [14]:
users = Table('users', metadata, autoload=True)
stm = select([users])
result = connection.execute(stm)
rows = result.fetchall()

for row in rows:
    print(row)

(1, 'Ravi', 'Kapoor')
(2, 'Rajiv', 'Khanna')
(3, 'Komal', 'Bhandari')
(4, 'Abdul', 'Sattar')
(5, 'Priya', 'Rajhans')
(6, 'Alex', None)

In [15]:
# Inspector
inspector = inspect(engine)
ls = inspector.get_table_names()
print(ls)
ls = inspector.get_columns('users')
print(ls)

['users']
[{'name': 'user_id', 'type': INTEGER(), 'nullable': False, 'default': "nextval('users_user_id_seq'::regclass)", 'autoincrement': True, 'comment': None}, {'name': 'name', 'type': VARCHAR(), 'nullable': True, 'default': None, 'autoincrement': False, 'comment': None}, {'name': 'lastname', 'type': VARCHAR(), 'nullable': True, 'default': None, 'autoincrement': False, 'comment': None}]

In [16]:
# Delete rows and drop table
users = Table('users', metadata, autoload=True)

def run(stmt):
    stmt.execute()
    
query = users.delete(users)
run(query)

users.drop(engine)

In [17]:
import numpy as np 
import pandas as pd 
import seaborn as sns
from IPython.display import display

In [18]:
iris = sns.load_dataset("iris")
display(iris)

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [19]:
# Write data into the table in PostgreSQL database
iris.to_sql('iris_dataset',engine,index=False)

In [20]:
# Read SQL database table into a DataFrame.
iris_df = pd.read_sql_table('iris_dataset', engine)
display(iris_df)

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [21]:
df = pd.read_sql('SELECT DISTINCT species FROM iris_dataset', engine)
display(df)

      species
0   virginica
1  versicolor
2      setosa

In [22]:
# Close the database connection.
connection.close()